app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
def index
	@users = User.paginate(page: params[:page]).search(params[:search])